app/views/recipes/_form.html.erb

    <%= f.label :category_id, "Category:", :id => "form-label" %>
    <%= f.select :category_id, options_for_select(Category.all.map{|s|[s.description, s.id]}), {}, :class => "btn btn-default dropdown-toggle form-control", data: { toggle: "dropdown" } %>
---
SELECT "categories".* FROM "categories"