app/views/recipes/edit.html.erb

SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 32], ["LIMIT", 1]]
---
  <button type="button" class="btn btn-default"><%= link_to 'Show', @recipe, :id => "pri-btn" %></button>
  <button type="button" class="btn btn-primary"><%= link_to 'Back', Category.find(@recipe.category_id) %></button>