app/views/recipes/show.html.erb

SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
        <button type="button" class="btn btn-warning"><%= link_to 'Edit', edit_recipe_path(@recipe) %></button>
        <button type="button" class="btn btn-primary"><%= link_to 'Back', Category.find(@recipe.category_id) %></button>