app/views/categories/show.html.erb

<ul class="all-cat-recipes">
  <% @category.recipes.each do |recipe| %>
---
SELECT "recipes".* FROM "recipes" WHERE "recipes"."category_id" = $1  [["category_id", 1]]